Revit 2027 API
ReferencePointArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	ReferencePoint item,
	int index
)
Public Overridable Sub Insert (
	item As ReferencePoint,
	index As Integer
)
public:
virtual void Insert(
	ReferencePoint^ item,
	int index
)
abstract Insert :
        item : ReferencePoint *
        index : int -> unit
override Insert :
        item : ReferencePoint *
        index : int -> unit
Parameters
item ReferencePoint
index Int32
See Also
Reference
ReferencePointArray Class
Autodesk.Revit.DB Namespace